# -*- mode:org; mode: flyspell; -*-

#+SETUPFILE: ../include/practice.h.org

#+TITLE: Discrete mathematics I. practice - Basics
#+SHORT_TITLE: Basics
** Sets - Solutions
   1. $A \cap B \neq \emptyset$, so $\exists x \in A \cap B$, so $A
      \cap C = \emptyset$ implies that $x\not\in A \cap C$, so
      $x\not\in C$, but then $x \in (A\cap B)\setminus C$ \ie $(A \cap
      B) \setminus C = \emptyset$ can not be true.  We have proven
      that there is no solution, \ie there are no such sets which
      satisfy these properties.
   2. HW***
   3. $\mathcal{A}=\{ \{a,b\}, \{b,c\}, \{c,a\}\}$ is disjoint but not
      pairwise disjoint.  Generally, pairwise disjoint sets are
      disjoint, (with the exception of the special case of a single
      non-empty set: \ie $\mathcal{B}=\{\{x\}\}$ is pairwise disjoint,
      but not disjoint).
   4. $\cup\mathcal{A}=\{a,b,c,d,e,f\}$, $\cap\mathcal{A} = \{a\}$.
   5. Let's solve this with a small python program.
      #+BEGIN_SRC python :results output :exports both
        x = ["apple", "plumb"]
        y = ["cat", "dog" ]
        empty = []

        def subset(A,B):
            for a in A:
                if not a in B: return False
            return True

        def intersect(A,B):
            r = []
            for a in A:
                if a in B: r.append(a)
            return r

        def setminus(A,B):
            r = []
            for a in A:
                if not a in B: r.append(a)
            return r

        def union(A,B):
            r = []
            for x in A:
                if not x in r: r.append(x)
            for x in B:
                if not x in r: r.append(x)
            return r
            
        testcases = [
            [[x],y],
            x,
            intersect([empty],x),
            setminus([x],[[x]]),
            union([x],x),
            union([x],[empty])
        ]
        print("The set                                 x in, x subset")
        for t in testcases:
            print( "{:<38}, {:<5}, {:<5}"
                .format(str(t), str(x in t), str(subset(x,t))))
        
      #+END_SRC

      #+RESULTS:
      : [[['apple', 'plumb']], ['cat', 'dog']], False, False
      : ['apple', 'plumb']                    , False, True 
      : []                                    , False, False
      : [['apple', 'plumb']]                  , True , False
      : [['apple', 'plumb'], 'apple', 'plumb'], True , True 
      : [['apple', 'plumb'], []]              , True , False
   6. 
   7. 
   8. 
   9. 
   10. 
   11. 
   12. 
   13. 
   14. 
